<a href="https://colab.research.google.com/github/hpnightowl/owlsbooks/blob/master/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [6]:
titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv", index_col = 'PassengerId')

In [9]:
titanic_data.head(5)

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S

[5 rows x 11 columns]

In [36]:
titanic_data.shape

(891, 11)

In [12]:
titanic_data.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [44]:
x = titanic_data[titanic_data.Sex =='male'].count()
print('Male:',x.Sex)
z = titanic_data[titanic_data.Sex =='female'].count()
print('Female:',z.Sex)

Male: 577
Female: 314

In [23]:
titanic_data.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [29]:
y = titanic_data[titanic_data.SibSp == 1].count()
print("Siblings:",y.SibSp)

Siblings: 209

In [37]:
n = titanic_data[titanic_data.Survived == 1].count()
print("People Survived:",n.Survived)
total = titanic_data.Survived.count()
print("Total People Survived:",total)
print("Ratio:",n.Survived/total)

People Survived: 342
Total People Survived: 891
Ratio: 0.3838383838383838

In [71]:
survived_passengers = titanic_data[titanic_data.Embarked == 'S'].count()
survived_passengers

Survived    644
Pclass      644
Name        644
Sex         644
Age         554
SibSp       644
Parch       644
Ticket      644
Fare        644
Cabin       129
Embarked    644
dtype: int64

In [59]:
median_of_fair = titanic_data.Fare.median()
print('Median of fair:',median_of_fair)

Median of fair: 14.4542

In [54]:
#DataFrame of men
print('Percent of Men Survived:',x.Survived/total*100)

Percent of Men Survived: 64.75869809203144

In [55]:
#DataFrame of Women
print('Percent of Men Survived:',z.Survived/total*100)

Percent of Men Survived: 35.24130190796858



---


From That i Can Conclude That Men survived more Than Women

---

In [57]:
median_of_age = titanic_data.Age.median()
print('Median Of Age:',median_of_age)

Median Of Age: 28.0

In [65]:
high_fare = titanic_data.Fare.sort_values(axis=0,ascending=False)
high_fare.head(5)

PassengerId
680    512.3292
259    512.3292
738    512.3292
342    263.0000
439    263.0000
Name: Fare, dtype: float64